# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：有一个三位数abc，如果：a^3 + b^3 + c^3 = abc ,
      则该数称为芙蓉数，编程求出所有的芙蓉数。

要求：使用abs()

---------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它函数中的
      任何内容，仅在函数的注释标志之间填入所编写的若干语句。
------------------------------------------------------'''
def intToArr( x , w, n ):
    #**********Program**********
    x = abs(int(x))
    n = abs(int(n))
    w = abs(int(w))
    if w<2:
       w=2
    if n<1:
       n=1
    R = [ 0 for i in range(0,n)]
    for i in range(n-1,-1,-1):
        R[i] = x % w
        x = x // w
    return R
    #**********  End  **********

def main():
    w = 10
    n = 3
    nm = w**n
    for x in range(100,nm):
        a = intToArr(x,w,n)
        if (a[0]**3+a[1]**3+a[2]**3 == x ):
            print( "【x=】",x ) 

if __name__ == '__main__':
    main()
