# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：甲乙丙丁4人同时开始放鞭炮，甲每隔t1 s放一次，乙每隔
      t2 s放一次，丙每隔t3 s放一次，丁每隔t4 s放一次，每人
      各放n次。
      函数fun的功能是根据形参炸响，只算一次响声，第一次响
      声是在第0s。

例如：若t1＝7，t2＝5，t3＝6，t4＝4，n＝10，则总共可听到28
      次鞭炮声。

---------------------------------------------------------
注意：除要求填空的位置之外，请勿改动程序中的其他内容。
------------------------------------------------------'''
def OK(i, t, n):
#**********SPACE**********
    return (i%t==0) and (i//t<n)

def fun(t1, t2, t3, t4, n): 
#**********SPACE**********
    maxt=t1
    if maxt < t2:
        maxt = t2
    if maxt < t3:
        maxt = t3
    if maxt < t4:
        maxt = t4
    count=1
#**********SPACE**********
    for t in range(1, maxt*(n-1)):
        if OK(t, t1, n) or OK(t, t2, n)or OK(t, t3, n) or OK(t, t4, n):
            count+=1  
#**********SPACE**********
    return count
 
def main():
    t1=7
    t2=5
    t3=6
    t4=4
    n=10
    r = fun(t1, t2, t3, t4, n)
    print("总共可听到%d次鞭炮声\n" %r)
    
if __name__ == '__main__':
    main()
