# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：average_sum函数的功能为求一批数中大于平均值的数的和。

---------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它函数中的
      任何内容，仅在函数的注释标志之间填入所编写的若干语句。
------------------------------------------------------'''
def average_sum(a,n):
    #**********Program**********
    sum=0
    k=0
    for i in range(n):
        sum=sum+a[i]
    average=sum*1.0//n
    for i in range(n):
        if(average<a[i]):
            k=k+a[i]
    return k
    #**********  End  **********

def main():
    a = []
    n = int(input("【输入数组的长度n：】"))
    for i in range(n):
        a.append(int(input("【请输入第%d个数组元素：】" %(i+1))))
    num=average_sum(a,n)
    print("【大于平均值的数的和为:】%d" %num);
    
if __name__ == '__main__':
    main()

