# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写fun函数，输入一个以回车结束的字符串(少于80个字符)，
      将它的内容逆序输出。如"ABCD" 的逆序为"DCBA"。

要求：fun函数中使用递归算法且包含输出语句

例如： 
      输入：
        Welcome to you!
      输出：
        !uoy ot emocleW 

---------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它函数中的
      任何内容，仅在函数的注释标志之间填入所编写的若干语句。
------------------------------------------------------'''
def fun(strinfo, index):
    #**********Program**********
    if(index+1)==len(strinfo):
        print(end="")
    else:
        fun(strinfo,index+1)
    print(strinfo[index],end="")
    #**********  End  **********

def main():
    s = input('【输入一个以回车结束的字符串(少于80个字符):】')
    while True:
        if len(s)<80:
            fun(s, 0)
            break
        else:
            s=input("【输入错误，请重新输入:】")
    
if __name__ == '__main__':
    main()    
