# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：企业发放的奖金根据利润提成。利润(i)低于或等于10万元
      时，奖金可提10%；利润高于10万元，低于20万元时，低于
      10万元的部分按10%提成，高于10万元的部分，可可提成7.5%
      ；20万到40万之间时，高于20万元的部分，可提成5%；40万
      到60万之间时高于40万元的部分，可提成3%；60万到100万
      之间时，高于60万元的部分，可提成1.5%，高于100万元时，
      超过100万元的部分按1%提成，从键盘输入当月利润i，求
      应发放奖金总数？

----------------------------------------------------------
注意：除要求填空的位置之外，请勿改动程序中的其他内容。
------------------------------------------------------'''
def  get_reward(I):
    rewards = 0    
    if I <= 10:
#**********SPACE**********
        rewards = I * 0.1
#**********SPACE**********
    elif (I > 10) and (I<=20):
        rewards = (I - 10) * 0.075 + get_reward(10)
    elif (I > 20) and (I <= 40):
        rewards = (I - 20) * 0.05 + get_reward(20)
    elif (I > 40) and (I <= 60):
        rewards = (I - 40) * 0.03 + get_reward(40)
    elif (I > 60) and (I <= 100):
#**********SPACE**********
        rewards = (I-60) * 0.015 + get_reward(60)
    else:
#**********SPACE**********
        rewards = get_reward(100) + (I-100) * 0.01
    return rewards

def main():
    num = int(input("请输入今年的公司净利润："))
    # 计算公司的年度奖金，单位：万元
    print("发放的奖金为：", get_reward(num / 10000) * 10000)
    
if __name__ == '__main__':
    main()
