[
  "quick-latex",
  "obsidian-style-settings",
  "quickadd",
  "obsidian-pandoc",
  "obsidian-mind-map",
  "obsidian-markmind",
  "obsidian-linter",
  "obsidian-kanban",
  "obsidian-hover-editor",
  "cm-editor-syntax-highlight-obsidian",
  "editing-toolbar",
  "easy-typing-obsidian",
  "cmdr",
  "obsidian-collapse-all-plugin",
  "obsidian-chartsview-plugin",
  "canvas-mindmap",
  "calendar",
  "obsidian-banners",
  "table-editor-obsidian",
  "obsidian-admonition",
  "obsidian-excalidraw-plugin",
  "better-export-pdf",
  "oz-clear-unused-images"
]