# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：从键盘为一维整型数组输入10个整数，找出其中最小的数，
      在main函数中输出。

要求：采用内置函数完成

---------------------------------------------------------
注意：部分源程序给出如下。请勿改动其它函数中的任何内容，
      仅在函数的注释标志之间填入所编写的若干语句。
------------------------------------------------------'''
def main():
    list_first = []
    for i in range(10):
        a = input("【请分别输入10个整数，每输入一个整数按回车确认:】")
    #**********Program**********
        list_first.append(int(a))
    x=min(list_first)
    #**********  End  **********
    print("【最小数是：】%d " %x);   

if __name__ == '__main__':
    main()
